/* 
  Localizable.strings
  Qbserve

  Created by Ivan Mir on 21/4/15.
  Copyright (c) 2015 QotoQot. All rights reserved.
*/


// MENUS

"menubar.show-window" = "Show Qbserve";
"menubar.tooltip.time" = "Productive time today: %@";
"menubar.tooltip.percents" = "Productivity today: %i%%";
"menubar.pause.start" = "Pause";
"menubar.pause.stop" = "Resume";
"menubar.quit-app" = "Quit";

"toolbar.dashboard.btn" = "OVERVIEW";
"toolbar.history.btn" = "DETAILS";
"toolbar.alerts.btn" = "NOTIFICATIONS";
"toolbar.settings.btn" = "SETTINGS";


// DASHBOARD

"dashboard.top.productive" = "PRODUCTIVE";
"dashboard.top.neutral" = "NEUTRAL";
"dashboard.top.distractive" = "DISTRACTING";
"dashboard.top.none" = "None";

"dashboard.progress-delta.not-found" = "NO RECORDS FOR\nPREVIOUS PERIOD";
"dashboard.progress-delta.day.more" = "%li%% MORE PRODUCTIVE\nTHAN YESTERDAY";
"dashboard.progress-delta.day.less" = "%li%% LESS PRODUCTIVE\nTHAN YESTERDAY";

"dashboard.progress-delta.yesterday.more" = "%li%% MORE PRODUCTIVE\nTHAN A DAY BEFORE";
"dashboard.progress-delta.yesterday.less" = "%li%% LESS PRODUCTIVE\nTHAN A DAY BEFORE";

"dashboard.progress-delta.week.more" = "%li%% MORE PRODUCTIVE\nTHAN LAST WEEK";
"dashboard.progress-delta.week.less" = "%li%% LESS PRODUCTIVE\nTHAN LAST WEEK";

"dashboard.progress-delta.month.more" = "%li%% MORE PRODUCTIVE\nTHAN LAST MONTH";
"dashboard.progress-delta.month.less" = "%li%% LESS PRODUCTIVE\nTHAN LAST MONTH";

"dashboard.progress-delta.no-change" = "NO CHANGE\nIN PRODUCTIVTY";

"dashboard.private-mode.btn.pause" = "Pause";
"dashboard.private-mode.btn.resume" = "Resume";
"dashboard.private-mode.status" = "Paused, minutes left: %@";

"dashboard.accessibility-popover.message" = "Please allow accessibility access for Qbserve.\nIt is required for correct domain and chat tracking.";
"dashboard.accessibility-popover.open-settings.btn" = "Open Settings";

// DETAILED HISTORY

// activities popover
"detailed-history.table.activities.popover.view-windows.btn" = "View Windows";
"detailed-history.table.activities.popover.ignore.btn.app" = "Ignore this app";
"detailed-history.table.activities.popover.ignore.btn.window" = "Ignore this activity";

"detailed-history.table.activities.popover.create-category" = "Add Category...";

// categories
"detailed-history.table.categories.add.btn" = "Add";

"detailed-history.table.categories.popover.title.create" = "Add Category:";
"detailed-history.table.categories.popover.title.modify" = "Edit Category:";
"detailed-history.table.categories.popover.name.default" = " (Default)";
"detailed-history.table.categories.popover.idle.hint" = "Track activities in this category even when mouse and keyboard are not used for %li minutes";
"detailed-history.table.categories.popover.add-category.btn" = "Add Category";
"detailed-history.table.categories.popover.delete-category.btn" = "Delete Category";

// table
"detailed-history.table.back.btn" = "Back";

"detailed-history.table.titles.percent" = "%";
"detailed-history.table.titles.total-time" = "TOTAL TIME";
"detailed-history.table.titles.activity" = "ACTIVITY";
"detailed-history.table.titles.category" = "CATEGORY";
"detailed-history.table.titles.category-type" = "TYPE";

"detailed-history.table.productive" = "Productive";
"detailed-history.table.neutral" = "Neutral";
"detailed-history.table.distractive" = "Distracting";

// can be taken from category name
//"detailed-history.table.tabs.uncategorized" = "Uncategorized";

"detailed-history.table.categories.delete.alert.message" = "Delete category \"%@\"?";
"detailed-history.table.categories.delete.alert.info" = "All apps and activities in this category will be moved to \"%@\"";
"detailed-history.table.categories.delete.alert.ok" = "Delete";
"detailed-history.table.categories.delete.alert.cancel" = "Cancel";
//"detailed-history.table.categories.default" = "Default";
//"detailed-history.table.categories.custom" = "Custom";


// ALERTS

"alerts.add-alert.btn" = "Add Alert";
"alerts.add-reminder.btn" = "Add Reminder";

"alerts.table.edit.popover.alert.title.add" = "Add Alert";
"alerts.table.edit.popover.alert.title.edit" = "Edit Alert";
"alerts.table.edit.popover.alerts.add.btn" = "Add Alert";
"alerts.table.edit.popover.alerts.delete.btn" = "Delete Alert";

"alerts.table.edit.popover.productive" = "All Productive";
"alerts.table.edit.popover.neutral" = "All Neutral";
"alerts.table.edit.popover.distractive" = "All Distracting";

"alerts.table.edit.popover.reminder.title.add" = "Add Reminder";
"alerts.table.edit.popover.reminder.title.edit" = "Edit Reminder";
"alerts.table.edit.popover.reminder.add.btn" = "Add Reminder";
"alerts.table.edit.popover.reminder.delete.btn" = "Delete Reminder";

"alerts.table.titles.type" = "TYPE";
"alerts.table.titles.rules" = "RULES";
"alerts.table.titles.days" = "DAYS";

"alerts.table.types.alert" = "Alert";
"alerts.table.types.reminder" = "Reminder";
"alerts.table.all-days" = "All days";

"alerts.notification.text.more-than" = "Spent more than %@";

// SETTINGS

"settings.restart-app.alert.message" = "App Restart Required";
"settings.restart-app.alert.description" = "Please quit and launch Qbserve again to apply this setting!";
"settings.feedback.please" = "Please keep this information for support requests";

"settings.help.btn" = "Help";
"settings.support-feedback.btn" = "Feedback";

"settings.export-logs.btn" = "Export Logs";
"settings.export-logs.btn.alert.message" = "No logs to export!";
"settings.export-logs.btn.alert.ok" = "Ok";


// REGISTRATION

"registration.title.trial" = "Trial days left: %li";
"registration.title.expired" = "Please purchase Qbserve to continue";

"registration.register.btn" = "Register";
"registration.purchase.btn" = "Open Store";
"registration.contact-us.btn" = "Contact Us";

"registration.alert.message" = "Qbserve can't recognize your license";
"registration.alert.description" = "Please check the credentials in your purchase confirmation mail, or contact us for assistance. Sorry!";


// COMMON

"activity.source.app" = "App";
"activity.source.window" = "Window";
"activity.source.file" = "File";
"activity.source.domain" = "Domain";
"activity.source.youtube" = "YouTube.com";
"activity.source.reddit" = "Reddit.com";
"activity.source.skype" = "Skype";
"activity.source.slack" = "Slack";
"activity.source.telegram" = "Telegram";
"activity.source.offline" = "Offline";
"activity.private" = "Private";

"common.days.sunday" = "Sunday";
"common.days.sunday.short" = "Sun";
"common.days.monday" = "Monday";
"common.days.monday.short" = "Mon";
"common.days.tuesday" = "Tuesday";
"common.days.tuesday.short" = "Tue";
"common.days.wednesday" = "Wednesday";
"common.days.wednesday.short" = "Wed";
"common.days.thursday" = "Thursday";
"common.days.thursday.short" = "Thu";
"common.days.friday" = "Friday";
"common.days.friday.short" = "Fri";
"common.days.saturday" = "Saturday";
"common.days.saturday.short" = "Sat";

"common.pause.duration.15m" = "15 minutes";
"common.pause.duration.30m" = "30 minutes";
"common.pause.duration.45m" = "45 minutes";
"common.pause.duration.1h" = "1 hour";
"common.pause.duration.2h" = "2 hours";
"common.pause.duration.3h" = "3 hours";
"common.pause.duration.6h" = "6 hours";

// productive
"category.avproduction" = "Audio/Video Production";
"category.design" = "Design";
"category.development" = "Development";
"category.documents" = "Documents & Writing";
"category.finances" = "Finances";
"category.general" = "General";
"category.management" = "Management";
"category.reference" = "Reference & Learning";

// neutral
"category.email" = "Email";
"category.files" = "File Management";
"category.food" = "Food & Drinks";
"category.health" = "Health & Fitness";
"category.home" = "Home";
"category.search" = "Search";
"category.travel" = "Travel & Maps";
"category.utilities" = "Utilities & Services";
"category.uncategorized" = "Uncategorized";

// distracting
"category.games" = "Games";
"category.leisure" = "Leisure";
"category.music" = "Music";
"category.news" = "News & Blogs";
"category.shopping" = "Shopping";
"category.social" = "Social";
"category.sports" = "Sports";
"category.videos" = "Videos & TV";